# MADE BY - ALPHA BABY

class Helper(object):
    HELP_M = '''```
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ```
**ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /**
'''

    HELP_B = '''```
❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ```
**ᴧsᴋ ʏσυʀ ᴅσυʙᴛs ᴧᴛ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ᴧʟʟ ᴄσϻϻᴧηᴅs ᴄᴧη ʙє υsєᴅ ᴡɪᴛʜ : /**
'''


    HELP_Sona = '''```
❖ ʜєʟᴘ ϻᴧɪη ϻєηυ```
**❖ ᴄʜσσsє ᴛʜє ᴄᴧᴛєɢσʀʏ ғσʀ ᴡʜɪᴄʜ ʏσυ ᴡᴧηηᴧ ɢєᴛ ʜєʟᴩ**
'''

    HELP_PROMOTION = '''
**─────────────────────────
ㅤㅤ❖ ᴘᴧɪᴅ ᴘʀσϻσᴛɪση ᴧᴠᴧɪʟᴧʙʟє ❖
─────────────────────────
❍ ᴄʜᴧᴛᴛɪηɢ ɢʀσυᴘ's
❍ ᴄσʟσʀ ᴛʀᴧᴅɪηɢ ɢᴧϻє's
❍ ᴄʜᴧηηєʟ's | ɢʀσυᴘ's .....
❍ ʙєᴛᴛɪηɢ ᴧᴅs σʀ ᴧηʏᴛʜɪηɢ
─────────────────────────
● ᴘʀσϻσᴛє ᴧηʏᴛʜɪηɢ ʏσυ ᴡᴧηᴛ ση συʀ ᴘʟᴧᴛғσʀϻ ᴡɪᴛʜ ʙєsᴛ ᴘʟᴧηs ᴧηᴅ ᴘʀσᴘєʀ sєʀᴠɪᴄєs
─────────────────────────
● ᴅᴧɪʟʏ, ᴡєєᴋʟʏ ᴧηᴅ ϻσηᴛʜʟʏ ᴘʟᴧη'ꜱ ᴧᴠᴧɪʟᴧʙʟє ꜰσʀ ʙɪɢ ʙυꜱɪηєꜱꜱєꜱ ᴧᴛ ᴛʜє ʙєꜱᴛ ᴘσꜱꜱɪʙʟє ᴄσηᴅɪᴛɪσηꜱ !
─────────────────────────
ʙєsᴛ ᴧηᴅ ᴄʜєᴧᴘ ɪη ᴛєʟєɢʀᴧϻ 400-500+ ϻєϻʙєʀs ɪη σηє ᴘʀσϻσᴛɪση ɢυʀᴧηᴛєє...
─────────────────────────
❍ ᴄσηᴛᴧᴄᴛ - [˹𝐊𝝸ɤ𝞃𝝸 𝝱𝝾𝞃𝘀˼](https://t.me/About_badnam_xd)
─────────────────────────**
'''
    HELP_ABOUT = '''
**─────────────────────────
│ ᴡєʟᴄσϻє ᴛσ ˹[тєᴧϻ ˹𝐊𝝸ɤ𝞃𝝸](https://t.me/About_badnam_xd)˼ ʙσᴛ sᴛᴧᴛυs │
─────────────────────────
       ❖ │ ʀєᴧʟ ᴛɪϻє ʙσᴛ's sᴛᴧᴛυs │❖
─────────────────────────
╭⎋ [нєєиα ꭙ ϻυsɪᴄ](https://t.me/Hena_robot) : ᴧʟɪᴠє 
╰⊚ υᴘᴛɪϻє : 12ʜ:58ϻ:20s | ᴄᴘυ : 5.0% | 
       υsᴧɢє : 24 | ᴧssɪsᴛᴧηᴛs : 01
       
╭⎋ [ѕυкσσи ꭙ ϻυsɪᴄ](https://t.me/SHERU_MUSIC_XD_BOT) : ᴧʟɪᴠє 
╰⊚ υᴘᴛɪϻє : 12ʜ:58ϻ:20s | ᴄᴘυ : 5.0% | 
       υsᴧɢє : 24 | ᴧssɪsᴛᴧηᴛs : 01

╭⎋ [˹𝐊𝝸ɤ𝞃𝝸 ꭙ ϻυsɪᴄ](https://t.me/Kriti_x_robot) : ᴧʟɪᴠє 
╰⊚ υᴘᴛɪϻє : 12ʜ:58ϻ:20s | ᴄᴘυ : 5.0% | 
       υsᴧɢє : 24 | ᴧssɪsᴛᴧηᴛs : 01
─────────────────────────
⊚ ʙσᴛ sᴛᴧᴛυs ᴧηᴅ ϻσʀє ʙσᴛs - [ᴄʟɪᴄᴋ ʜєʀє](https://t.me/About_badnam_xd)
─────────────────────────
⊚ ʟᴧsᴛ ᴄʜєᴄᴋєᴅ ση : ᴅᴧᴛє : 10 ᴊᴀɴ 2025 
─────────────────────────
❍ 𝐏ᴏᴡєʀєᴅ 𝖡ʏ » [˹𝐊𝝸ɤ𝞃𝝸 𝝱𝝾𝞃𝘀˼](https://t.me/About_badnam_xd)
─────────────────────────**
'''
    HELP_ALLBOT = '''
**─────────────────────────
❖ ᴧ ϻᴜsɪᴄ + ϻᴧηᴧɢєϻєηᴛ ʙσᴛ ғσʀ ᴛєʟєɢʀᴧϻ ɢʀσᴜᴘs / ᴄʜᴧηηєʟs
─────────────────────────
● ᴡʀɪᴛᴛєη ɪη ➥ [ᴩʏᴛʜση](https://www.python.org/)
● ᴅᴧᴛᴧʙᴧsє ➥ [ϻᴏηɢᴏ-ᴅʙ](https://www.mongodb.com/)
─────────────────────────
● ηᴏ ʟᴀɢ ɪssᴜєs ηᴏ ᴧᴅs ηᴏ ʙᴜɢs.
● sᴜᴘᴘᴏʀᴛ ᴧʟʟ ᴛɪϻє sᴛᴧʏ ᴡɪᴛʜ ᴜs.
● ᴇηᴊᴏʏ ғєєʟ ғʀєє ϻᴜsɪᴄ ᴡɪᴛʜ 𝐊ʀɪᴛɪ.
● ᴧᴅᴅ ϻє ηᴏᴡ ʙᴧʙʏ ɪɴ ʏᴏᴜʀ ɢʀσᴜᴘs.
─────────────────────────
❖ υᴘᴅᴧᴛєs ᴄʜᴧηηєʟ ➥ [˹𝐊𝝸ɤ𝞃𝝸 𝝱𝝾𝞃𝘀˼](https://t.me/About_badnam_xd)
❖ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ➥ [˹𝐊𝝸ɤ𝞃𝝸 𝝱𝝾𝞃𝘀˼](https://t.me/About_badnam_xd)
❖ ʙᴏᴛ σᴡηєʀ ➥ [˹𝐊𝝸ɤ𝞃𝝸 𝝱𝝾𝞃𝘀˼](https://t.me/About_badnam_xd)
❖ ʀєᴘσ ʟɪηᴋ ➥ [ᴄʟɪᴄᴋ-ʜєʀє](github.com/Badnam019)
─────────────────────────
❖ ᴄʟɪᴄᴋ ση ᴛʜє ʜєʟᴩ ʙυᴛᴛση ᴛσ ɢєᴛ ɪηғσ
   ᴧʙσυᴛ ϻʏ ϻσᴅυʟєs ᴧηᴅ ᴄσϻϻᴧηᴅs...!!
─────────────────────────**
'''

#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------


    
    fullpromote = {
    'can_change_info': True,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': True,
    'can_invite_users': True,
    'can_restrict_members': True,
    'can_pin_messages': True,
    'can_promote_members': True,
    'can_manage_chat': True,
    }

    
    promoteuser = {
    'can_change_info': False,
    'can_post_messages': True,
    'can_edit_messages': True,
    'can_delete_messages': False,
    'can_invite_users': True,
    'can_restrict_members': False,
    'can_pin_messages': False,
    'can_promote_members': False,
    'can_manage_chat': True,
    }




#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
#------------------------------------------------------------------------------------------------------------------------
